blueskycoco/rt-thread/bsp/tm4c129x/applications/con_epi.c
#include <rthw.h>
#include <rtthread.h>
#include <rtdevice.h>
#include "board.h"
#include "inc/hw_epi.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "driverlib/epi.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/interrupt.h"
#include "driverlib/rom_map.h"
#include "driverlib/udma.h"
#include "con_socket.h"
extern struct rt_semaphore rx_sem[4];
struct rt_semaphore udma_sem;
struct rt_semaphore tx_done;
struct rt_mutex mutex;
extern bool phy_link;
int ack_got=0;
int cur_len=0;
void InitSWTransfer(uint32_t dest,uint32_t src,uint32_t len);
uint8_t pui8ControlTable[1024] __attribute__ ((aligned(1024)));

//*****************************************************************************
//
//! \addtogroup epi_examples_list
//! <h1>EPI SRAM Mode (sdram)</h1>
//!
//! This example shows how to configure the TM4C129 EPI bus in SRAM mode.  It
//! assumes that a 64Mbit SRAM is attached to EPI0.
//!
//! For the EPI SRAM mode, the pinout is as follows:
//!     Address11:0 - EPI0S11:0
//!     Bank1:0     - EPI0S14:13
//!     Data15:0    - EPI0S15:0
//!     DQML        - EPI0S16
//!     DQMH        - EPI0S17
//!     /CAS        - EPI0S18
//!     /RAS        - EPI0S19
//!     /WE         - EPI0S28
//!     /CS         - EPI0S29
//!     SDCKE       - EPI0S30
//!     SDCLK       - EPI0S31
//!
//! This example uses the following peripherals and I/O signals.  You must
//! review these and change as needed for your own board:
//! - EPI0 peripheral
//! - GPIO Port A peripheral (for EPI0 pins)
//! - GPIO Port B peripheral (for EPI0 pins)
//! - GPIO Port C peripheral (for EPI0 pins)
//! - GPIO Port G peripheral (for EPI0 pins)
//! - GPIO Port K peripheral (for EPI0 pins)
//! - GPIO Port L peripheral (for EPI0 pins)
//! - GPIO Port M peripheral (for EPI0 pins)
//! - GPIO Port N peripheral (for EPI0 pins)
//! - EPI0S0  - PK0
//! - EPI0S1  - PK1
//! - EPI0S2  - PK2
//! - EPI0S3  - PK3
//! - EPI0S4  - PC7
//! - EPI0S5  - PC6
//! - EPI0S6  - PC5
//! - EPI0S7  - PC4
//! - EPI0S8  - PA6
//! - EPI0S9  - PA7
//! - EPI0S10 - PG1
//! - EPI0S11 - PG0
//! - EPI0S12 - PM3
//! - EPI0S13 - PM2
//! - EPI0S14 - PM1
//! - EPI0S15 - PM0
//! - EPI0S16 - PL0
//! - EPI0S17 - PL1
//! - EPI0S18 - PL2
//! - EPI0S19 - PL3
//! - EPI0S28 - PB3
//! - EPI0S29 - PN2
//! - EPI0S30 - PN3
//! - EPI0S31 - PK5
//!
//! The following UART signals are configured only for displaying console
//! messages for this example.  These are not required for operation of EPI0.
//! - UART0 peripheral
//! - GPIO Port A peripheral (for UART0 pins)
//! - UART0RX - PA0
//! - UART0TX - PA1
//!
//! This example uses the following interrupt handlers.  To use this example
//! in your own application you must add these interrupt handlers to your
//! vector table.
//! - None.
//
//*****************************************************************************

//*****************************************************************************
//
// Use the following to specify the GPIO pins used by the SRAM EPI bus.
//
//*****************************************************************************
#define EPI_PORTA_PINS (GPIO_PIN_7 | GPIO_PIN_6)
#define EPI_PORTB_PINS (GPIO_PIN_3)
#define EPI_PORTC_PINS (GPIO_PIN_7 | GPIO_PIN_6 | GPIO_PIN_5 | GPIO_PIN_4)
#define EPI_PORTG_PINS (GPIO_PIN_1 | GPIO_PIN_0)
#define EPI_PORTK_PINS (GPIO_PIN_4 | GPIO_PIN_3 | GPIO_PIN_2 | GPIO_PIN_1 | GPIO_PIN_0)
#define EPI_PORTL_PINS (GPIO_PIN_1 | GPIO_PIN_0)
#define EPI_PORTM_PINS (GPIO_PIN_3 | GPIO_PIN_2 | GPIO_PIN_1 | GPIO_PIN_0)
#define EPI_PORTN_PINS (GPIO_PIN_2 | GPIO_PIN_3)

//*****************************************************************************
//
// The starting and ending address for the 64MB SRAM chip (32Meg x 16bits) on
// the SRAM daughter board.
//
//*****************************************************************************
#define SRAM_START_ADDRESS 0x00000000
#define SRAM_END_ADDRESS   0x000003FF
#if 0
#define SIGNAL_CONFIG_SOCKET0 	0x00
#define SIGNAL_CONFIG_SOCKET1 	0x01
#define SIGNAL_CONFIG_SOCKET2 	0x02
#define SIGNAL_CONFIG_SOCKET3 	0x03
#define SIGNAL_DATA_SOCKET0 	0x04
#define SIGNAL_DATA_SOCKET1 	0x05
#define SIGNAL_DATA_SOCKET2 	0x06
#define SIGNAL_DATA_SOCKET3 	0x07
#define ACK_SIGNAL				0xF0 //ack last signal ACK_SIGNAL|SIGNAL_WE_GOT
#define SIGNAL_CONFIG_WITH_IPV6 0xc0 //ipv6 length is long , 0xc0|0x00,0x01,0x02,0x03 etc.
#define SOCKET0_R_ADDR			0x00000000
#define SOCKET0_W_ADDR			0x0000007D
#define SOCKET1_R_ADDR			0x000000FA
#define SOCKET1_W_ADDR			0x00000177
#define SOCKET2_R_ADDR			0x000001F4
#define SOCKET2_W_ADDR			0x00000271
#define SOCKET3_R_ADDR			0x000002EE
#define SOCKET3_W_ADDR			0x0000036B
#define SOCKET0_R_LEN_REG		0x000003E8//for config data len or socket data len
#define SOCKET0_W_LEN_REG		0x000003E9
#define SOCKET1_R_LEN_REG		0x000003EA
#define SOCKET1_W_LEN_REG		0x000003EB
#define SOCKET2_R_LEN_REG		0x000003EC
#define SOCKET2_W_LEN_REG		0x000003ED
#define SOCKET3_R_LEN_REG		0x000003EE
#define SOCKET3_W_LEN_REG		0x000003EF
#define A_TO_B_SOURCE_REG		0x000003F0
#define B_TO_A_SOURCE_REG		0x000003F1	//for config or raw,which socket
#define A_TO_B_PKT_LEN0			0x000003F2
#define A_TO_B_PKT_LEN1			0x000003F3
#define B_TO_A_PKT_LEN0			0x000003F4	//for config or raw,which socket
#define B_TO_A_PKT_LEN1			0x000003F5
#define CONFIG_A_TO_B_ADDR		0x000003FC	//sw signal to sure read done.
#define CONFIG_B_TO_A_ADDR		0x000003FD	//sw signal to sure read done.
#define CONFIG_ADDR				0x000003FD
#define A_TO_B_SIGNAL	   		0x000003FF//tm4c129x is A
#define B_TO_A_SIGNAL	   		0x000003FE//stm32 is B
#define USEFUL_LEN				1021
#define SOCKET_BUF_LEN			250
#define SIGNAL_DATA_IN			0x55
#define SIGNAL_ACK_RCV			0x33
#else
#define USEFUL_LEN				1020
#define CMD_RAW_DATA			0x33
#define CMD_CONFIG_DATA			0x55
#define ACK_RAW_DATA			0x77
#define ACK_CONFIG_DATA			0x99
#define REGISTER_LEN_ADDR0		0x3FC
#define REGISTER_LEN_ADDR1		0x3FD
#define INT_DEVICE		   		0x000003FF
#define INT_HOST		   		0x000003FE
#endif
rt_bool_t can_send=RT_FALSE;
rt_bool_t op_state=RT_FALSE;//send state
rt_uint8_t *to_socket[32]={RT_NULL};
int index_epi=0;
#define EPI_BUF_LEN 1040
/*
work flow:
stm32 write data or config to tm4c129x
1 b_to_a int raise(stm32 write B_TO_A_SIGNAL addr data with SIGNAL_CONFIG_SOCKET0 or SIGNAL_DATA_SOCKET0 etc.)
2 read B_TO_A_SIGNAL addr to find what is happen.
3 if SIGNAL_CONFIG_SOCKET0 ... 
	read SOCKET0_R_LEN_REG to get config length
	read CONFIG_ADDR length data to config socket0,... (if SIGNAL_CONFIG_SOCKET0|SIGNAL_CONFIG_WITH_IPV6 read SOCKET0_R_ADDR)
	write ACK_SIGNAL|SIGNAL_CONFIG_SOCKET0 to A_TO_B_SIGNAL to ack the last SIGNAL_CONFIG_SOCKET0 cmd
	stm32 get int and get data ACK_SIGNAL|SIGNAL_CONFIG_SOCKET0 , this whole config process is done.
4 if SIGNAL_DATA_SOCKET0 ...
	read SOCKET0_R_LEN_REG to get config length
	read SOCKET0_R_ADDR length data to config socket0,...
	write ACK_SIGNAL|SIGNAL_DATA_SOCKET0 to A_TO_B_SIGNAL to ack the last SIGNAL_DATA_SOCKET0 cmd
	stm32 get int and get data ACK_SIGNAL|SIGNAL_DATA_SOCKET0 , this whole data transfer process is done.

tm4c129x get network data to inform stm32
1 a_to_b int raise (tm32c129x write A_TO_B addr with SIGNAL_DATA_SOCKET0 etc .)
2 stm32 read A_TO_B_SIGNAL addr to find what is happen
3 if SIGNAL_DATA_SOCKET0 ...
   read SOCKET0_W_LEN_REG to get data length
   read SOCKET0_W_ADDR with data length last got
   write ACK_SIGNAL | SIGNAL_DATA_SOCKET0 to B_TO_A_SIGNAL addr to ack the last SIGNAL_DATA_SOCKET0
4 if SIGNAL_CONFIG_SOCKET0 ...
   read SOCKET0_W_LEN_REG to get data length
   read CONFIG_ADDR with data length last got (if SIGNAL_CONFIG_SOCKET0|SIGNAL_CONFIG_WITH_IPV6 got ,read SOCKET0_W_ADDR)
   write ACK_SIGNAL | SIGNAL_CONFIG_SOCKET0 to B_TO_A_SIGNAL addr to ack the last SIGNAL_DATA_SOCKET0   
*/
//*****************************************************************************
//
// The Mapping address space for the EPI SRAM.
//
//*****************************************************************************
#define SRAM_MAPPING_ADDRESS 0x60000000

//*****************************************************************************
//
// A pointer to the EPI memory aperture.  Note that g_pui8EPISdram is declared
// as volatile so the compiler should not optimize reads out of the image.
//
//*****************************************************************************
static volatile uint8_t *g_pui8EPISdram;
struct rt_memheap system_heap;

