blueskycoco/rt-thread/bsp/tm4c129x/applications/con_epi.c
void sram_init(void)
{
    /* initialize the built-in SRAM as a memory heap */
    rt_memheap_init(&system_heap,
                    "system",
                    (void *)SRAM_MAPPING_ADDRESS,
                    1024);
}

void *sram_malloc(unsigned long size)
{
    return rt_memheap_alloc(&system_heap, size);
}
RTM_EXPORT(sram_malloc);

void sram_free(void *ptr)
{
    rt_memheap_free(ptr);
}
RTM_EXPORT(sram_free);

void *sram_realloc(void *ptr, unsigned long size)
{
    return rt_memheap_realloc(&system_heap, ptr, size);
}
RTM_EXPORT(sram_realloc);

//*****************************************************************************
//
// Configure EPI0 in SRAM mode.  The EPI memory space is setup using an a
// simple C array.  This example shows how to read and write to an SRAM card
// using the EPI bus in SRAM mode.
//
//*****************************************************************************
int epi_init(void)
{
    uint32_t ui32Val, ui32Freq,i;

    //
    // Display the setup on the console.
    //
    rt_kprintf("EPI DUAL SRAM Mode ->\n");
    rt_kprintf("  Type: SRAM\n");
    rt_kprintf("  Starting Address: 0x%08x\n", SRAM_MAPPING_ADDRESS);
    rt_kprintf("  End Address: 0x%08x\n",
               (SRAM_MAPPING_ADDRESS + SRAM_END_ADDRESS));
    rt_kprintf("  Data: 8-bit\n");
    rt_kprintf("  Size: 1KB (128 x 8bits)\n\n");

    //
    // The EPI0 peripheral must be enabled for use.
    //
    SysCtlPeripheralDisable(SYSCTL_PERIPH_EPI0);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_EPI0);

    //
    // For this example EPI0 is used with multiple pins on PortA, B, C, G, H,
    // K, L, M and N.  The actual port and pins used may be different on your
    // part, consult the data sheet for more information.
    // TODO: Update based upon the EPI pin assignment on your target part.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOL);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOM);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
	//SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOQ);
	/*
	HOST 8 mode
	 EPI0S0 D0      PK0
	 EPI0S1 D1      PK1
	 EPI0S2 D2      PK2
	 EPI0S3 D3      PK3
	 EPI0S4 D4      PC7
	 EPI0S5 D5      PC6
	 EPI0S6 D6      PC5
	 EPI0S7 D7      PC4
	 EPI0S8 A0      PA6
	 EPI0S9 A1      PA7
	 EPI0S10 A2    PG1
	 EPI0S11 A3    PG0
	 EPI0S12 A4    PM3
	 EPI0S13 A5    PM2
	 EPI0S14 A6    PM1
	 EPI0S15 A7    PM0
	 EPI0S16 A8    PL0
	 EPI0S17 A9    PL1
	 EPI0S18 A10 
	 EPI0S19 A11 
	 EPI0S20 A12
	 EPI0S26 SEML PL4(just cy7c)
	 EPI0S28 OEL   PB3
	 EPI0S29 R/WL PN2
	 EPI0S30 CS0n PN3
	 EPI0S31 INTL  PK5
	 EPI0S32 BUSY PK4
	*/
	
	MAP_GPIOIntDisable(GPIO_PORTK_BASE, GPIO_PIN_5);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTK_BASE, GPIO_PIN_5);
	MAP_GPIOIntTypeSet(GPIO_PORTK_BASE, GPIO_PIN_5, GPIO_FALLING_EDGE);
	MAP_IntEnable(INT_GPIOK);
	MAP_GPIOIntEnable(GPIO_PORTK_BASE, GPIO_PIN_5);
	int ui32Status = MAP_GPIOIntStatus(GPIO_PORTK_BASE, true);
	MAP_GPIOIntClear(GPIO_PORTK_BASE, ui32Status);

    //
    // This step configures the internal pin muxes to set the EPI pins for use
    // with EPI.  Please refer to the datasheet for more information about pin
    // muxing.  Note that EPI0S27:20 are not used for the EPI SRAM
    // implementation.
    // TODO: Update this section based upon the EPI pin assignment on your
    // target part.
    //
    //
	MAP_GPIOPinConfigure(GPIO_PK0_EPI0S0);
	GPIOPinTypeEPI(GPIO_PORTK_BASE, GPIO_PIN_0);
	MAP_GPIOPinConfigure(GPIO_PK1_EPI0S1);
	GPIOPinTypeEPI(GPIO_PORTK_BASE, GPIO_PIN_1);
	MAP_GPIOPinConfigure(GPIO_PK2_EPI0S2);
	GPIOPinTypeEPI(GPIO_PORTK_BASE, GPIO_PIN_2);
	MAP_GPIOPinConfigure(GPIO_PK3_EPI0S3);
	GPIOPinTypeEPI(GPIO_PORTK_BASE, GPIO_PIN_3);
	MAP_GPIOPinConfigure(GPIO_PK4_EPI0S32);
	GPIOPinTypeEPI(GPIO_PORTK_BASE, GPIO_PIN_4);
	MAP_GPIOPinConfigure(GPIO_PC7_EPI0S4);
	GPIOPinTypeEPI(GPIO_PORTC_BASE, GPIO_PIN_7);
	MAP_GPIOPinConfigure(GPIO_PC6_EPI0S5);
	GPIOPinTypeEPI(GPIO_PORTC_BASE, GPIO_PIN_6);
	MAP_GPIOPinConfigure(GPIO_PC5_EPI0S6);
	GPIOPinTypeEPI(GPIO_PORTC_BASE, GPIO_PIN_5);
	MAP_GPIOPinConfigure(GPIO_PC4_EPI0S7);
	GPIOPinTypeEPI(GPIO_PORTC_BASE, GPIO_PIN_4);
	MAP_GPIOPinConfigure(GPIO_PA6_EPI0S8);
	GPIOPinTypeEPI(GPIO_PORTA_BASE, GPIO_PIN_6);
	MAP_GPIOPinConfigure(GPIO_PA7_EPI0S9);
	GPIOPinTypeEPI(GPIO_PORTA_BASE, GPIO_PIN_7);
	MAP_GPIOPinConfigure(GPIO_PG1_EPI0S10);
	GPIOPinTypeEPI(GPIO_PORTG_BASE, GPIO_PIN_1);
	MAP_GPIOPinConfigure(GPIO_PG0_EPI0S11);
	GPIOPinTypeEPI(GPIO_PORTG_BASE, GPIO_PIN_0);
	MAP_GPIOPinConfigure(GPIO_PM3_EPI0S12);
	GPIOPinTypeEPI(GPIO_PORTM_BASE, GPIO_PIN_3);
	MAP_GPIOPinConfigure(GPIO_PM2_EPI0S13);
	GPIOPinTypeEPI(GPIO_PORTM_BASE, GPIO_PIN_2);
	MAP_GPIOPinConfigure(GPIO_PM1_EPI0S14);
	GPIOPinTypeEPI(GPIO_PORTM_BASE, GPIO_PIN_1);
	MAP_GPIOPinConfigure(GPIO_PM0_EPI0S15);
	GPIOPinTypeEPI(GPIO_PORTM_BASE, GPIO_PIN_0);
	MAP_GPIOPinConfigure(GPIO_PL0_EPI0S16);
	GPIOPinTypeEPI(GPIO_PORTL_BASE, GPIO_PIN_0);
	MAP_GPIOPinConfigure(GPIO_PL1_EPI0S17);
	GPIOPinTypeEPI(GPIO_PORTL_BASE, GPIO_PIN_1);
	MAP_GPIOPinConfigure(GPIO_PB3_EPI0S28);
	GPIOPinTypeEPI(GPIO_PORTB_BASE, GPIO_PIN_3);
	MAP_GPIOPinConfigure(GPIO_PN2_EPI0S29);
	GPIOPinTypeEPI(GPIO_PORTN_BASE, GPIO_PIN_2);
	MAP_GPIOPinConfigure(GPIO_PN3_EPI0S30);
	GPIOPinTypeEPI(GPIO_PORTN_BASE, GPIO_PIN_3);
    //
    // Is our current system clock faster than we can drive the SRAM clock?
    //
    if(SysClock > 60000000)
    {
        //
        // Yes. Set the EPI clock to half the system clock.
        //
        EPIDividerSet(EPI0_BASE, 1);
    }
    else
    {
        //
        // With a system clock of 60MHz or lower, we can drive the SRAM at
        // the same rate so set the divider to 0.
        //
        EPIDividerSet(EPI0_BASE, 0);
    }

    //
    // Sets the usage mode of the EPI module.  For this example we will use
    // the SRAM mode to talk to the external 64MB SRAM daughter card.
    //
    EPIModeSet(EPI0_BASE, EPI_MODE_HB8);
	EPIConfigHB8Set(EPI0_BASE, (EPI_HB8_MODE_SRAM| EPI_HB8_CSCFG_CS|EPI_HB8_IN_READY_EN),0);

    //
    // Set the address map.  The EPI0 is mapped from 0x60000000 to 0x01FFFFFF.
    // For this example, we will start from a base address of 0x60000000 with
    // a size of 256MB.  Although our SRAM is only 64MB, there is no 64MB
    // aperture option so we pick the next larger size.
    //
    EPIAddressMapSet(EPI0_BASE, EPI_ADDR_RAM_SIZE_64KB | EPI_ADDR_RAM_BASE_6);

    //
    // Wait for the SRAM wake-up to complete by polling the SRAM
    // initialization sequence bit.  This bit is true when the SRAM interface
    // is going through the initialization and false when the SRAM interface
    // it is not in a wake-up period.
    //
    while(HWREG(EPI0_BASE + EPI_O_STAT) &  EPI_STAT_INITSEQ)
    {
    }
    //
    // Set the EPI memory pointer to the base of EPI memory space.  Note that
    // g_pui8EPISdram is declared as volatile so the compiler should not
    // optimize reads out of the memory.  With this pointer, the memory space
    // is accessed like a simple array.
    //
    g_pui8EPISdram = (uint8_t *)0x60000000;

    //
    // Read the initial data in SRAM, and display it on the console.
    //
    rt_kprintf("  SRAM Initial Data:\n");
    rt_kprintf("     Mem[0x6000.0000] = 0x%02x\n",
               g_pui8EPISdram[SRAM_START_ADDRESS]);
    rt_kprintf("     Mem[0x6000.0001] = 0x%02x\n",
               g_pui8EPISdram[SRAM_START_ADDRESS + 1]);
    rt_kprintf("     Mem[0x6000.03FE] = 0x%02x\n",
               g_pui8EPISdram[SRAM_END_ADDRESS - 3]);
    rt_kprintf("     Mem[0x6000.03FF] = 0x%02x\n\n",
               g_pui8EPISdram[SRAM_END_ADDRESS-2]);

    //
    // Display what writes we are doing on the console.
    //
    rt_kprintf("  SRAM Write:\n");
    rt_kprintf("     Mem[0x6000.0000] <- 0xab\n");
    rt_kprintf("     Mem[0x6000.0001] <- 0x12\n");
    rt_kprintf("     Mem[0x6000.03FE] <- 0xdc\n");
    rt_kprintf("     Mem[0x6000.03FF] <- 0x2a\n\n");

    //
    // Write to the first 2 and last 2 address of the SRAM card.  Since the
    // SRAM card is word addressable, we will write words.
    //
    g_pui8EPISdram[SRAM_START_ADDRESS] = 0xab;
    g_pui8EPISdram[SRAM_START_ADDRESS + 1] = 0x12;
    g_pui8EPISdram[SRAM_END_ADDRESS - 3] = 0xdc;
    g_pui8EPISdram[SRAM_END_ADDRESS-2] = 0x2a;
    //
    // Read back the data you wrote, and display it on the console.
    //
    rt_kprintf("  SRAM Read:\n");
    rt_kprintf("     Mem[0x6000.0000] = 0x%02x\n",
              g_pui8EPISdram[SRAM_START_ADDRESS]);
    rt_kprintf("     Mem[0x6000.0001] = 0x%02x\n",
               g_pui8EPISdram[SRAM_START_ADDRESS + 1]);
    rt_kprintf("     Mem[0x6000.03FE] = 0x%02x\n",
               g_pui8EPISdram[SRAM_END_ADDRESS - 3]);
    rt_kprintf("     Mem[0x6000.03FF] = 0x%02x\n\n",
               g_pui8EPISdram[SRAM_END_ADDRESS-2]);
    //
    // Read and write operations were successful.  Return with no errors.
    //
    rt_kprintf("Read and write to external SRAM was successful!\n");
	for(i=0;i<256;i++)
		g_pui8EPISdram[i]=i;
	for(i=256;i<512;i++)
		g_pui8EPISdram[i]=i-256;
	for(i=512;i<768;i++)
		g_pui8EPISdram[i]=i-512;
	for(i=768;i<USEFUL_LEN;i++)
		g_pui8EPISdram[i]=i-768;
	for(i=0;i<USEFUL_LEN;i++)
	{
		if(g_pui8EPISdram[i]!=(i%256))
			rt_kprintf("<%02x> %d failed\n",g_pui8EPISdram[i],i%256);
		rt_kprintf("0x%02x ",g_pui8EPISdram[i]);			
		if(((i+1)%16)==0)
			rt_kprintf("\n");
		if(((i+1)%256)==0)
			rt_kprintf("\n");
	}
	rt_kprintf("\n");
	rt_mutex_init(&mutex, "epimutex", RT_IPC_FLAG_FIFO);
	// Enable the uDMA controller at the system level.	Enable it to continue
	// to run while the processor is in sleep.
	//
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
	MAP_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_UDMA);
	
	//
	// Enable the uDMA controller error interrupt.	This interrupt will occur
	// if there is a bus error during a transfer.
	//
	MAP_IntEnable(INT_UDMAERR);
	
	//
	// Enable the uDMA controller.
	//
	MAP_uDMAEnable();
	
	//
	// Point at the control table to use for channel control structures.
	//
	MAP_uDMAControlBaseSet(pui8ControlTable);
	rt_sem_init(&udma_sem, "udma_sem", 0, 0);
	rt_sem_init(&tx_done, "tx_done", 0, 0);
	rt_kprintf("%02X Got in HOST\n",g_pui8EPISdram[INT_HOST]);
	rt_kprintf("%02X Got in DEVICE\n",g_pui8EPISdram[INT_DEVICE]);
    return(0);	
}
void IntGpioK()
{
	int i=0;
	if(MAP_GPIOIntStatus(GPIO_PORTK_BASE, true)&GPIO_PIN_5)
	{
		MAP_GPIOIntClear(GPIO_PORTK_BASE, GPIO_PIN_5);
		//rt_kprintf("Device has read data done.\n");
		rt_sem_release(&(tx_done));//host
		//rt_sem_release(&(rx_sem[0]));//device
	}
}
char check_raw_ack()
{
	//rt_kprintf("%02X Got in check_raw_ack\n",g_pui8EPISdram[INT_HOST]);
	if(g_pui8EPISdram[INT_HOST]==ACK_RAW_DATA)
		return 1;
	return 0;
}
void Signal_To_Device(int len,char cmd)
{
	g_pui8EPISdram[REGISTER_LEN_ADDR1]=(len>>8)&0xff;
	g_pui8EPISdram[REGISTER_LEN_ADDR0]=len&0xff;	
	g_pui8EPISdram[INT_DEVICE]=cmd;
	rt_sem_take(&tx_done, RT_WAITING_FOREVER);
}
void Signal_To_Host(int len,char cmd)
{
	g_pui8EPISdram[REGISTER_LEN_ADDR1]=(len>>8)&0xff;
	g_pui8EPISdram[REGISTER_LEN_ADDR0]=len&0xff;	
	g_pui8EPISdram[INT_HOST]=cmd;
	rt_sem_take(&tx_done, RT_WAITING_FOREVER);
}

int _epi_write(int index, const void *buffer, int size,unsigned char signal)
{	
	int len=0;
	if(size<=USEFUL_LEN)
	{
		memcpy((void *)g_pui8EPISdram,buffer,size);
		Signal_To_Device(size,CMD_RAW_DATA);
		check_raw_ack();
	}
	else
	{
		while(len!=size)
		{
			if((len+USEFUL_LEN)<size)
			{
				memcpy((void *)g_pui8EPISdram,buffer+len,USEFUL_LEN);
				Signal_To_Device(USEFUL_LEN,CMD_RAW_DATA);
				check_raw_ack();
				len=len+USEFUL_LEN;
			}
			else
			{
				memcpy((void *)g_pui8EPISdram,buffer+len,size-len);
				Signal_To_Device(size-len,CMD_RAW_DATA);
				check_raw_ack();
				len+=size-len;
			}
		}
	}
	return 0;	
}
void _epi_ack(char* ack,int len)
{
	memcpy((void *)g_pui8EPISdram,ack,len);
	g_pui8EPISdram[REGISTER_LEN_ADDR1]=(len>>8)&0xff;
	g_pui8EPISdram[REGISTER_LEN_ADDR0]=len&0xff;	
	g_pui8EPISdram[INT_HOST]=ACK_CONFIG_DATA;
}
void config_send(rt_uint8_t *cmd,int len)
{	
	int i=0;
	int crc=0;

	//len=sizeof(cmd);
	if(len!=3)
	{
		for(i=0;i<len-2;i++)
			crc=crc+cmd[i];
		cmd[len-2]=(crc>>8) & 0xff;
		cmd[len-1]=crc&0xff;
	}
	memcpy((void *)g_pui8EPISdram,cmd,len);
	Signal_To_Device(len,CMD_CONFIG_DATA);
}
void check_meminfo()
{
	int i=0;	
	unsigned char check[1+8]					={0xF5,0x8A,0x25,0xff,0x26,0xfa,0x03,0xc3};
	while(1)
	{
		config_send(check,8);
		if(g_pui8EPISdram[INT_HOST]==ACK_CONFIG_DATA)
		{
			int len = (g_pui8EPISdram[REGISTER_LEN_ADDR1]<<8)|g_pui8EPISdram[REGISTER_LEN_ADDR0];
			if(g_pui8EPISdram[3]==0x01)
			{
				//rt_kprintf("==>Device is cnn\n");
				break;
			}
			else
				rt_thread_delay(100);
		}
		else
			rt_kprintf("INT_HOST is %02X\n",g_pui8EPISdram[INT_HOST]);
	}
}

int _epi_send_config(rt_uint8_t *cmd,int len)
{
	int result=0;
	char config_result[]={0xf5,0x8c,0x00};
	config_send(cmd,len);
	if(g_pui8EPISdram[INT_HOST]==ACK_CONFIG_DATA)
	{
		int len = (g_pui8EPISdram[REGISTER_LEN_ADDR1]<<8)|g_pui8EPISdram[REGISTER_LEN_ADDR0];
		if(memcmp((void *)g_pui8EPISdram,(void *)config_result,len)==0 && len==3)
		{
			rt_kprintf("Send Command ok\n");
			result =1;
		}
		else
		{
			rt_kprintf("Send Command Failed %02X %2X %02X\n",g_pui8EPISdram[0],
				g_pui8EPISdram[1],g_pui8EPISdram[2]);
		}
	}
	else
		rt_kprintf("INT_HOST is %02X\n",g_pui8EPISdram[INT_HOST]);
	return result;
}
void _epi_read_config(rt_uint8_t *cmd,int len)
{
	int i=0;
	while(1){
	config_send(cmd,len);
	if(g_pui8EPISdram[INT_HOST]==ACK_CONFIG_DATA)
	{
		int len = (g_pui8EPISdram[REGISTER_LEN_ADDR1]<<8)|g_pui8EPISdram[REGISTER_LEN_ADDR0];
		//for(i=0;i<len;i++)
		//	rt_kprintf("==>%02x\n",g_pui8EPISdram[i]);
		if(g_pui8EPISdram[3]==0x02)
		{
			rt_kprintf("==>Device is cnn\n");
			break;
		}
		else
			rt_thread_delay(100);
	}
	else
		rt_kprintf("INT_HOST is %02X\n",g_pui8EPISdram[INT_HOST]);
		}
}
extern unsigned char check_mem[9];
extern unsigned char result_mem[9];

void _epi_read()
{
	rt_uint8_t *buf1,i;
	int len=0;
	len=g_pui8EPISdram[REGISTER_LEN_ADDR1]<<8|g_pui8EPISdram[REGISTER_LEN_ADDR0];
	unsigned char source=g_pui8EPISdram[INT_DEVICE];
	if(source==CMD_RAW_DATA)
	{
		if(phy_link&&g_socket[0].connected)
		{
			buf1=NULL;
			//while(1)
			//{
			buf1 =(rt_uint8_t *)malloc(len*sizeof(rt_uint8_t));
			if(buf1==RT_NULL)
			{
				rt_kprintf("buf is RT_NULL %d\r\n",len);				
				g_pui8EPISdram[INT_HOST]=ACK_RAW_DATA;
				return ;
			//	rt_thread_delay(100);
			}
			//else
			//	break;
			//}
			rt_memcpy(buf1,(void *)g_pui8EPISdram,len);
			rt_data_queue_push(&g_data_queue[0],buf1, len, RT_WAITING_FOREVER);			
		}
		g_pui8EPISdram[INT_HOST]=ACK_RAW_DATA;
	}
	else
	{
		rt_uint8_t *p=(rt_uint8_t *)malloc(len*sizeof(rt_uint8_t));
		rt_memcpy(p,(void *)g_pui8EPISdram,len);
		if(rt_memcmp(p,check_mem,8)==0)
		{
			int crc=0;
			char *tmp=(char *)rt_malloc(1020);
			if(tmp!=NULL)
			{
				result_mem[3]=0x01;
				rt_free(tmp);
				//rt_kprintf("have rom\n");
			}
			else
				result_mem[3]=0x0;
			for(i=0;i<6;i++)
			crc=crc+result_mem[i];
			result_mem[6]=(crc>>8)&0xff;
			result_mem[7]=(crc)&0xff;
			memcpy((void *)g_pui8EPISdram,result_mem,8);
			g_pui8EPISdram[REGISTER_LEN_ADDR1]=(sizeof(result_mem)>>8)&0xff;
			g_pui8EPISdram[REGISTER_LEN_ADDR0]=sizeof(result_mem)&0xff;	
			g_pui8EPISdram[INT_HOST]=ACK_CONFIG_DATA;
		}
		else if(p[0]==0xf5 && p[1]==0x8a)
		{		
			int check_sum=0,longlen=0;
			rt_kprintf("EPI Config len %d\r\n",len);
			for(i=0;i<len-2;i++)
			{
				rt_kprintf("%02x ",p[i]);
				check_sum+=p[i];
			}
			rt_kprintf("\r\n");
			if(check_sum==(p[len-2]<<8|p[len-1]))
			{
				if(p[2]==0x0c || p[2]==0x0d || p[2]==0x0e || p[2]==0x0f || p[2]==0x20)
					longlen=p[3]; 				
				usb_config(p+2,longlen,0);
				ack_result(0,CONFIG_EXCUTE_OK);
			}
			else
			{
				ack_result(0,CONFIG_CRC_ERROR);
			}
		}
		else if(p[0]==0xf5 && p[1]==0x8b)
		{
			int lenout;
			char *tmp=send_out(0,p[2],&lenout);
			if(tmp!=NULL)
			{
				int ii=0;
				for(ii=0;ii<lenout;ii++)
					rt_kprintf("%2x ",tmp[ii]);
				rt_kprintf("\n");
				memcpy((void *)g_pui8EPISdram,(void *)tmp, lenout);
				len=lenout;				
				g_pui8EPISdram[REGISTER_LEN_ADDR1]=(len>>8)&0xff;
				g_pui8EPISdram[REGISTER_LEN_ADDR0]=len&0xff;	
				g_pui8EPISdram[INT_HOST]=ACK_CONFIG_DATA;
			}
			else
			{
				rt_kprintf("some error\r\n");
				memcpy((void *)g_pui8EPISdram,(void *)COMMAND_FAIL, sizeof(COMMAND_FAIL));
				len=sizeof(COMMAND_FAIL);
				ack_result(0,CONFIG_CRC_ERROR);
			}
		}
		free(p);
	}
	return ;	
}
void uDMAErrorHandler(void)
{
    uint32_t ui32Status;

    //
    // Check for uDMA error bit
    //
    ui32Status = MAP_uDMAErrorStatusGet();

    //
    // If there is a uDMA error, then clear the error and increment
    // the error counter.
    //
    if(ui32Status)
    {
        MAP_uDMAErrorStatusClear();
        //g_ui32uDMAErrCount++;
        rt_kprintf("uDMA Error intr.\n");
    }
}

void uDMAIntHandler(void)
{
    uint32_t ui32Mode;

    //
    // Check for the primary control structure to indicate complete.
    //
    ui32Mode = MAP_uDMAChannelModeGet(UDMA_CHANNEL_SW);
    if(ui32Mode == UDMA_MODE_STOP)
    {
        //
        // Increment the count of completed transfers.
        //
        //g_ui32MemXferCount++;

        //
        // Configure it for another transfer.
        //
        //ROM_uDMAChannelTransferSet(UDMA_CHANNEL_SW, UDMA_MODE_AUTO,
        //                           g_ui32SrcBuf, g_ui32DstBuf,
        //                           MEM_BUFFER_SIZE);

        //
        // Initiate another transfer.
        //
        //ROM_uDMAChannelEnable(UDMA_CHANNEL_SW);
        //ROM_uDMAChannelRequest(UDMA_CHANNEL_SW);
        //rt_kprintf("uDMA done.\n");
        rt_sem_release(&udma_sem);
    }

    //
    // If the channel is not stopped, then something is wrong.
    //
    else
    {
        //g_ui32BadISR++;
        rt_kprintf("uDMA Bad intr.\n");
    }
}
void InitSWTransfer(uint32_t dest,uint32_t src,uint32_t len)
{

    //
    // Enable interrupts from the uDMA software channel.
    //
    MAP_IntEnable(INT_UDMA);

    //
    // Put the attributes in a known state for the uDMA software channel.
    // These should already be disabled by default.
    //
    MAP_uDMAChannelAttributeDisable(UDMA_CHANNEL_SW,
                                    UDMA_ATTR_USEBURST | UDMA_ATTR_ALTSELECT |
                                    (UDMA_ATTR_HIGH_PRIORITY |
                                    UDMA_ATTR_REQMASK));

    //
    // Configure the control parameters for the SW channel.  The SW channel
    // will be used to transfer between two memory buffers, 32 bits at a time.
    // Therefore the data size is 32 bits, and the address increment is 32 bits
    // for both source and destination.  The arbitration size will be set to 8,
    // which causes the uDMA controller to rearbitrate after 8 items are
    // transferred.  This keeps this channel from hogging the uDMA controller
    // once the transfer is started, and allows other channels cycles if they
    // are higher priority.
    //
    MAP_uDMAChannelControlSet(UDMA_CHANNEL_SW | UDMA_PRI_SELECT,
                              UDMA_SIZE_32 | UDMA_SRC_INC_32 | UDMA_DST_INC_32 |
                              UDMA_ARB_8);

    //
    // Set up the transfer parameters for the software channel.  This will
    // configure the transfer buffers and the transfer size.  Auto mode must be
    // used for software transfers.
    //
    MAP_uDMAChannelTransferSet(UDMA_CHANNEL_SW | UDMA_PRI_SELECT,
                               UDMA_MODE_AUTO, src, dest,
                               len);

    //
    // Now the software channel is primed to start a transfer.  The channel
    // must be enabled.  For software based transfers, a request must be
    // issued.  After this, the uDMA memory transfer begins.
    //
    MAP_uDMAChannelEnable(UDMA_CHANNEL_SW);
    MAP_uDMAChannelRequest(UDMA_CHANNEL_SW);
	rt_sem_take(&udma_sem, RT_WAITING_FOREVER);
}

